blog/drafts/solve-spelling-bee-kanren.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-02 Fri 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solve the Spelling Bee with kanren</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Solve the Spelling Bee with kanren</h1>
<p>
The constraints are:
</p>
<ol class="org-ol">
<li>Only 7 letters are allowed to write words of arbitrary lengths;</li>
<li>One those letters is compulsory <code>membero(compulsory_letter, word)</code></li>
<li>The word must be in the dictionary <code>dictionary(word)</code></li>
</ol>


<div id="outline-container-orgbd42283" class="outline-2">
<h2 id="orgbd42283"><span class="todo TODO">TODO</span> Download simple dictionary and add constraint</h2>
<div class="outline-text-2" id="text-orgbd42283">
<p>
We can find <a target='_blank' rel='noopener noreferrer' class='external' href="https://raw.githubusercontent.com/dwyl/english-words/master/words.txt">lists of english words online</a>. The file linked before is only 4Mb.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> kanren <span style="color: #F0DFAF; font-weight: bold;">import</span> fact, run, var

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Populate a dictionary (start with short words)</span>
<span style="color: #DFAF8F;">dictionary</span> = Relation(<span style="color: #CC9393;">"dictionary"</span>)
<span style="color: #F0DFAF; font-weight: bold;">for</span> word <span style="color: #F0DFAF; font-weight: bold;">in</span> dictionary:
    fact(dictionary, word)

<span style="color: #DFAF8F;">q</span> = var()
<span style="color: #DFAF8F;">res</span> = run(1, q, dictionary(q))
<span style="color: #F0DFAF; font-weight: bold;">print</span>(res)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdec653d" class="outline-2">
<h2 id="orgdec653d"><span class="todo TODO">TODO</span> Constraint that one letter is compulory</h2>
<div class="outline-text-2" id="text-orgdec653d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> kanren <span style="color: #F0DFAF; font-weight: bold;">import</span> membero, var

<span style="color: #DFAF8F;">compulsory_letter</span> = <span style="color: #CC9393;">"a"</span>
<span style="color: #DFAF8F;">word</span> = var()
<span style="color: #DFAF8F;">goal</span> = membero(compulsory_letter, word)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4d76eb" class="outline-2">
<h2 id="orga4d76eb"><span class="todo TODO">TODO</span> Constraint on the only allowed letters</h2>
<div class="outline-text-2" id="text-orga4d76eb">
<p>
The `letter<sub>constraints</sub>` goal is actually not enough; it will not guarantee that other letters won't be present in the word. We need a goal that states that a set is a subset of another?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">from</span> kanren <span style="color: #F0DFAF; font-weight: bold;">import</span> membero, fact, Relation

lall(*(<span style="color: #F0DFAF; font-weight: bold;">not</span>(membero(forbidden, word)) <span style="color: #F0DFAF; font-weight: bold;">for</span> forbidden <span style="color: #F0DFAF; font-weight: bold;">in</span> forbidden_letters)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>